/* Show #nav bar only after #unofficial banner leaves the viewport */
new IntersectionObserver((entries, _) => {
  const nav = document.getElementById("nav");

  if (entries[0].isIntersecting) {
    nav.classList.remove("on");
  } else {
    nav.classList.add("on");
  }
}, {}).observe(document.getElementById("unofficial"));

/* Stop #mugen animations when out of viewport */
new IntersectionObserver((entries, _) => {
  const mugen = entries[0].target;

  if (entries[0].isIntersecting) {
    mugen.classList.remove("off");
  } else {
    mugen.classList.add("off");
  }
}, {}).observe(document.getElementById("mugen"));

/* Update .torifuda at the exact moment when it is facing sideways */
document.querySelector("#mugen .torifuda").addEventListener("animationiteration", e => {
  const torifuda = e.target;
  const n = Math.floor(100 * Math.random());

  const [njigimari, kaminoku, shimonoku] = [
    /* 00-09 */
    [3, "あきのたのかりほのいほのとまをあらみ", "わがころもではつゆにぬれつつ"],
    [3, "はるすぎてなつきにけらししろたへの", "ころもほすてふあまのかぐやま"],
    [2, "あしびきのやまどりのをのしだりをの", "ながながしよをひとりかもねむ"],
    [2, "たごのうらにうちいでてみればしろたへの", "ふじのたかねにゆきはふりつつ"],
    [2, "おくやまにもみぢふみわけなくしかの", "こゑきくときぞあきはかなしき"],
    [2, "かささぎのわたせるはしにおくしもの", "しろきをみればよぞふけにける"],
    [3, "あまのはらふりさけみればかすがなる", "みかさのやまにいでしつきかも"],
    [3, "わがいほはみやこのたつみしかぞすむ", "よをうぢやまとひとはいふなり"],
    [3, "はなのいろはうつりにけりないたづらに", "わがみよにふるながめせしまに"],
    [2, "これやこのゆくもかへるもわかれては", "しるもしらぬもあふさかのせき"],
    /* 10-19 */
    [6, "わたのはらやそしまかけてこぎいでぬと", "ひとにはつげよあまのつりぶね"],
    [3, "あまつかぜくものかよひぢふきとぢよ", "をとめのすがたしばしとどめむ"],
    [2, "つくばねのみねよりおつるみなのがは", "こひぞつもりてふちとなりぬる"],
    [2, "みちのくのしのぶもぢずりたれゆゑに", "みだれそめにしわれならなくに"],
    [6, "きみがためはるののにいでてわかなつむ", "わがころもでにゆきはふりつつ"],
    [2, "たちわかれいなばのやまのみねにおふる", "まつとしきかばいまかへりこむ"],
    [2, "ちはやぶるかみよもきかずたつたがは", "からくれなゐにみづくくるとは"],
    [1, "すみのえのきしによるなみよるさへや", "ゆめのかよひぢひとめよくらむ"],
    [4, "なにはがたみじかきあしのふしのまも", "あはでこのよをすぐしてよとや"],
    [2, "わびぬればいまはたおなじなにはなる", "みをつくしてもあはむとぞおもふ"],
    /* 20-29 */
    [3, "いまこむといひしばかりにながつきの", "ありあけのつきをまちいでつるかな"],
    [1, "ふくからにあきのくさきのしをるれば", "むべやまかぜをあらしといふらむ"],
    [2, "つきみればちぢにものこそかなしけれ", "わがみひとつのあきにはあらねど"],
    [2, "このたびはぬさもとりあへずたむけやま", "もみぢのにしきかみのまにまに"],
    [3, "なにしおはばあふさかやまのさねかづら", "ひとにしられでくるよしもがな"],
    [2, "をぐらやまみねのもみぢばこころあらば", "いまひとたびのみゆきまたなむ"],
    [3, "みかのはらわきてながるるいづみがは", "いつみきとてかこひしかるらむ"],
    [3, "やまざとはふゆぞさびしさまさりける", "ひとめもくさもかれぬとおもへば"],
    [4, "こころあてにをらばやをらむはつしもの", "おきまどはせるしらぎくのはな"],
    [3, "ありあけのつれなくみえしわかれより", "あかつきばかりうきものはなし"],
    /* 30-39 */
    [6, "あさぼらけありあけのつきとみるまでに", "よしののさとにふれるしらゆき"],
    [3, "やまがはにかぜのかけたるしがらみは", "ながれもあへぬもみぢなりけり"],
    [2, "ひさかたのひかりのどけきはるのひに", "しづこころなくはなのちるらむ"],
    [2, "たれをかもしるひとにせむたかさごの", "まつもむかしのともならなくに"],
    [3, "ひとはいさこころもしらずふるさとは", "はなぞむかしのかににほひける"],
    [2, "なつのよはまだよひながらあけぬるを", "くものいづこにつきやどるらむ"],
    [2, "しらつゆにかぜのふきしくあきののは", "つらぬきとめぬたまぞちりける"],
    [3, "わすらるるみをばおもはずちかひてし", "ひとのいのちのをしくもあるかな"],
    [3, "あさぢふのをののしのはらしのぶれど", "あまりてなどかひとのこひしき"],
    [2, "しのぶれどいろにいでにけりわがこひは", "ものやおもふとひとのとふまで"],
    /* 40-49 */
    [2, "こひすてふわがなはまだきたちにけり", "ひとしれずこそおもひそめしか"],
    [4, "ちぎりきなかたみにそでをしぼりつつ", "すゑのまつやまなみこさじとは"],
    [2, "あひみてののちのこころにくらぶれば", "むかしはものをおもはざりけり"],
    [3, "おふことのたえてしなくばなかなかに", "ひとをもみをもうらみざらまし"],
    [3, "あはれともいふべきひとはおもほえで", "みのいたづらになりぬべきかな"],
    [2, "ゆらのとをわたるふなびとかぢをたえ", "ゆくへもしらぬこひのみちかな"],
    [2, "やへむぐらしげれるやどのさびしきに", "ひとこそみえねあきはきにけり"],
    [3, "かぜをいたみいはうつなみのおのれのみ", "くだけてものをおもふころかな"],
    [3, "みかきもりゑじのたくひのよるはもえて", "ひるはきえつつものをこそおもへ"],
    [6, "きみがためをしからざりしいのちさへ", "ながくもがなとおもひけるかな"],
    /* 50-59 */
    [2, "かくとだにえやはいぶきのさしもぐさ", "さしもしらじなもゆるおもひを"],
    [2, "あけぬればくるるものとはしりながら", "なほうらめしきあさぼらけかな"],
    [3, "なげきつつひとりぬるよのあくるまは", "いかにひさしきものとかはしる"],
    [3, "わすれじのゆくすゑまではかたければ", "けふをかぎりのいのちともがな"],
    [2, "たきのおとはたえてひさしくなりぬれど", "なこそながれてなほきこえけれ"],
    [3, "あらざらむこのよのほかのおもひでに", "いまひとたびのあふこともがな"],
    [1, "めぐりあひてみしやそれともわかぬまに", "くもがくれにしよはのつきかな"],
    [3, "ありまやまゐなのささはらかぜふけば", "いでそよひとをわすれやはする"],
    [2, "やすらはでねなましものをさよふけて", "かたぶくまでのつきをみしかな"],
    [3, "おほえやまいくののみちのとほければ", "まだふみもみずあまのはしだて"],
    /* 60-69 */
    [2, "いにしへのならのみやこのやへざくら", "けふここのへににほひぬるかな"],
    [2, "よをこめてとりのそらねははかるとも", "よにあふさかのせきはゆるさじ"],
    [3, "いまはただおもひたえなむとばかりを", "ひとづてならでいふよしもがな"],
    [6, "あさぼらけうぢのかはぎりたえだえに", "あらはれわたるせぜのあじろぎ"],
    [2, "うらみわびほさぬそでだにあるものを", "こひにくちなむなこそをしけれ"],
    [2, "もろともにあはれとおもへやまざくら", "はなよりほかにしるひともなし"],
    [3, "はるのよのゆめばかりなるたまくらに", "かひなくたたむなこそをしけれ"],
    [4, "こころにもあらでうきよにながらへば", "こひしかるべきよはのつきかな"],
    [3, "あらしふくみむろのやまのもみぢばは", "たつたのかはのにしきなりけり"],
    [1, "さびしさにやどをたちいでてながむれば", "いづこもおなじあきのゆふぐれ"],
    /* 70-79 */
    [2, "ゆふさればかどたのいなばおとづれて", "あしのまろやにあきかぜぞふく"],
    [2, "おとにきくたかしのはまのあだなみは", "かけじやそでのぬれもこそすれ"],
    [2, "たかさごのをのへのさくらさきにけり", "とやまのかすみたたずもあらなむ"],
    [2, "うかりけるひとをはつせのやまおろしよ", "はげしかれとはいのらぬものを"],
    [4, "ちぎりおきしさせもがつゆをいのちにて", "あはれことしのあきもいぬめり"],
    [6, "わたのはらこぎいでてみればひさかたの", "くもゐにまがふおきつしらなみ"],
    [1, "せをはやみいはにせかるるたきがはの", "われてもすゑにあはむとぞおもふ"],
    [3, "あはぢしまかよふちどりのなくこゑに", "いくよねざめぬすまのせきもり"],
    [3, "あきかぜにたなびくくものたえまより", "もれいづるつきのかげのさやけさ"],
    [3, "ながからむこころもしらずくろかみの", "みだれてけさはものをこそおもへ"],
    /* 80-89 */
    [1, "ほととぎすなきつるかたをながむれば", "ただありあけのつきぞのこれる"],
    [2, "おもひわびさてもいのちはあるものを", "うきにたへぬはなみだなりけり"],
    [5, "よのなかよみちこそなけれおもひいる", "やまのおくにもしかぞなくなる"],
    [3, "ながらへばまたこのごろやしのばれむ", "うしとみしよぞいまはこひしき"],
    [2, "よもすがらものおもふころはあけやらで", "ねやのひまさへつれなかりけり"],
    [3, "なげけとてつきやはものをおもはする", "かこちがほなるわがなみだかな"],
    [1, "むらさめのつゆもまだひぬまきのはに", "きりたちのぼるあきのゆふぐれ"],
    [4, "なにはえのあしのかりねのひとよゆゑ", "みをつくしてやこひわたるべき"],
    [2, "たまのをよたえなばたえねながらへば", "しのぶることのよわりもぞする"],
    [2, "みせばやなをじまのあまのそでだにも", "ぬれにぞぬれしいろはかはらず"],
    /* 90-99 */
    [2, "きりぎりすなくやしもよのさむしろに", "ころもかたしきひとりかもねむ"],
    [3, "わがそではしほひにみえぬおきのいしの", "ひとこそしらねかわくまもなし"],
    [5, "よのなかはつねにもがもななぎさこぐ", "あまのをぶねのつなでかなしも"],
    [2, "みよしののやまのあきかぜさよふけて", "ふるさとさむくころもうつなり"],
    [3, "おほけなくうきよのたみにおほふかな", "わがたつそまにすみぞめのそで"],
    [3, "はなさそふあらしのにはのゆきならで", "ふりゆくものはわがみなりけり"],
    [2, "こぬひとをまつほのうらのゆふなぎに", "やくやもしほのみもこがれつつ"],
    [3, "かぜそよぐならのをがはのゆふぐれは", "みそぎぞなつのしるしなりける"],
    [3, "ひともをしひともうらめしあぢきなく", "よをおもふゆゑにものおもふみは"],
    [2, "ももしきやふるきのきばのしのぶにも", "なほあまりあるむかしなりけり"],
  ][n];

  /*
   * Special care must be taken for "ありあけのつきをまちいでつるかな"
   * as it consists of 16 characters and thus does not fit in 5x3 grid.
   */
  if (n == 20) {
    torifuda.style.gridTemplateRows = "repeat(6, 1fr)";
  } else {
    torifuda.style.gridTemplateRows = "repeat(5, 1fr)";
  }

  for (let i = 0; i < 16; i++) {
    torifuda.children[i].innerText = shimonoku.at(i) ?? "";
  }

  /*
   * Hyakunin Isshu is an anthology of one hundred waka, a classical Japanese
   * style poem. A waka consists of two parts "kaminoku" and "shimonoku". In
   * competitive karuta, game master reads out "kaminoku" and then you need to
   * take corresponding "shimonoku" card before your opponent takes one. To get
   * ahead of the opponent, you would like to memorize distinctive syllables of
   * each waka, or "kimariji". Technically, a "kimariji" is the shortest unique
   * prefix of waka, so you can take card as soon as "kimariji" is read even
   * before the entire "kaminoku" is read. "kimarijinosaki" means the rest part
   * after "kimariji". When "kimariji" of a given poem is n-syllable long, the
   * poem is called "n-jigimari".
   */
  const kimariji = kaminoku.slice(0, njigimari);
  const kimarijinosaki = kaminoku.slice(njigimari);

  document.querySelector("#mugen .n").innerText = n.toString().padStart(2, "0") + ":";
  document.querySelector("#mugen .kimariji").innerText = kimariji;
  document.querySelector("#mugen .kimarijinosaki").innerText = kimarijinosaki;
});
